#include <iostream>
#include <string>
#include <format>

const std::string WELLCOME_MESSAGE = u8R"(Hunt the Wumpus!

Ты в пещере с 20 комнатами, и из каждой комнаты ведут 3 туннеля.
В пещере разбросаны 3 летучие мыши и 3 ямы, а в колчане у тебя 5 особых супер стрел против злого Вумпуса. Удачи.

)";

const std::string HELP_MESSAGE = u8R"(Добро пожаловать в игру «Охота на Вумпуса».

Вумпус обычно обитает в пещере из двадцати комнат, и в каждой комнате есть три тоннеля, ведущие в другие комнаты пещеры.
Однако пещеры могут отличаться в зависимости от параметров, заданных при запуске игры.

В игре есть следующие опасности для отважных искателей приключений:

- Ямы -- если вы упадёте в одну из бездонных ям, вас выкинет на противоположную сторону Земли,
         и вы окажетесь в весьма плачевном состоянии для продолжения квеста, поскольку вы мертвы.

- Летучие мыши -- как и в любой другой пещере, в пещере Вумпуса водятся летучие мыши.
                  Они немного опаснее: если вы наткнётесь на одну из их комнат,
                  они схватят вас и унесут в другое место пещеры.

- Вумпус -- если вы случайно войдёте в комнату, где находится Вумпус,
            вы обнаружите, что он с большим аппетитом относится к молодым отважным людям!

Вумпуса не беспокоят эти опасности, так как у него присоски на лапах,
и он слишком велик, чтобы летучие мыши могли его поднять. По натуре он не особо подвижен,
но если вы попытаетесь выстрелить в него и промахнётесь, есть шанс, что он сам переместится в другую комнату.

В каждом ходу вы можете либо переместиться, либо выстрелить кривой стрелой.
Переместиться — укажите команду 'm' и номер комнаты назначения.
Выстрелить — укажите команду 's' и список комнат, через которые должна пролететь смертоносная стрела. Например: m9, s8 4.

Если указанный путь для стрелы неверен, она запутается в комнате,
которую не поймёт, и случайно выберет один из тоннелей, чтобы продолжить полёт.
Вы можете случайно выстрелить себе в ногу, если будете невнимательны!
С другой стороны, если вы поразите Вумпуса — вы ВЫИГРАЛИ!

Удачи.)";

const std::string INFO_MESSAGE = u8R"(Ты в комнате {} пещеры, и у тебя осталось 5 стрел.)";

const std::string PITS_MESSAGE = u8"*вжух* (я чувствую сквозняк от каких‑то ям)";

const std::string WUMPUS_MESSAGE = u8"*нюх* (я чу́ю зло Вумпуса поблизости!)";

const std::string BATS_AROUND = u8"*шуршание* *шуршание* (должны быть летучие мыши поблизости)";

const std::string TUNNELS_MESSAGE = u8"Отсюда туннели ведут в комнаты {}, {} и {}.";

const std::string INCORRECT_ARROWS_WAY = u8R"(*тюк* Стрела не смогла найти путь из {} в {}
    Она случайно летит в комнату 17!)";

const std::string FAIL_INTO_PIT = u8R"(*AAAAUUUUGGGGHHHHHhhhhhhhhhh...*
Звук свиста и восходящий поток воздуха, когда ты входил в эту комнату пещеры,
явно не дали тебе понять о наличии бездонной ямы. У тебя уймётся много времени,
чтобы обдумать эту ошибку, пока ты падаешь на многие мили к ядру Земли.
Смотри с позитивной стороны: по крайней мере ты сможешь выяснить, был ли Жюль Верн прав...)";

const std::string ESCAPE_FROM_PIT = u8R"(Без сознательного усилия вы хватаетесь за край пещеры и удачно схватываетеся за скалистый выступ.
Под вашими ногами простираются бескрайние глубины бездонной пропасти!
Камень осыпается у вас из-под ног!)";

const std::string BATS_EVENT = u8"*шлёп* *шлёп* *шлёп* (огромные летучие мыши поднимают тебя и переносят в другую комнату!)";

const std::string DEATH_BY_WUMPUS = u8R"(«РРРР!» «хрум» «нюх» «хрум»!
К великому удовольствию Вумпуса, ты прямо шагнул ему в пасть, став одним из самых лёгких ужинов,
которых он когда-либо имел! Для тебя же это довольно неприятная смерть.
Единственное хорошее — ему так давно не чистили зубы, что ты тут же потерял сознание от вони!)";

const std::string RICOCHET = u8R"(Хрясь! Внезапная пронизывающая боль сообщает вам, что рикошет вашей безумной стрелы привёл к тому,
что она застряла в вашем боку, причиняя неимоверную агонию. Злой Вумпус, обладающий психическими силами,
замечает это и немедленно бросается к вам, не чтобы помочь, увы, а чтобы СЪЕСТЬ ВАС! (ЧАВК))";

const std::string ARROW_FLEW_CAVE = u8"Тусклый отблеск подсказывает вам, что стрела прошла через магический туннель!";

const std::string END_OF_ARROWS = u8R"(Вы оборачиваетесь и смотрите на колчан, и с тяжёлым чувством понимаете,
что только что выпустили последнюю стрелу (в переносном смысле тоже).
Почувствовав это своими психическими силами, злой Вумпус яростно прорывается через пещеру,
находит вас и с могучим *РРРАААХ* съедает вас заживо!)";

const std::string WIN_MESSAGE = u8R"(Хрясь! *стон* *грохот*

Ужасный рёв наполняет пещеру, и вы с улыбкой понимаете, что убили злого Вумпуса и выиграли игру!
Задерживаться долго не хочется, однако — Вумпус не только знаменит, но и его труп издаёт такой запах,
что одним только вдохом может погубить самого отважного искателя приключений!!)";

const std::string MOVE_WHERE = u8"\t> Куда идти? Попробуй ввести «m{}».";

const std::string SHOOT_WHERE = u8"\t> В какую комнату стрелять? Попробуй ввести «s{}».";

const std::string INCORRECT_INPUT = u8"\t> Я не понимаю. Попробуйте ввести «?» для справки.";

int main()
{
    std::cout << WELLCOME_MESSAGE << '\n';
    return 0;
}
